# GetCompInsertLocOff

## Description
Gets the component insert location offset of the object.

```pascal
FUNCTION GetCompInsertLocOff(object : HANDLE): REAL;
```

```python
def vs.GetCompInsertLocOff(object):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a wall, Wall Style, or the Wall Preferences.|

## See Also
VS Functions:
SetCompInsertLocOff

## Version
Availability: from Vectorworks 2023

## Category
* Objects - Architectural